Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 70, 70, 16)        448       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 70, 70, 32)        4640      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 70, 70, 64)        18496     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 70, 70, 128)       73856     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 35, 35, 128)       0         
_________________________________________________________________
dropout (Dropout)            (None, 35, 35, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 156800)            0         
_________________________________________________________________
dense (Dense)                (None, 128)               20070528  
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 99        
=================================================================
Total params: 20,178,403
Trainable params: 20,178,403
Non-trainable params: 0
_________________________________________________________________
